stage1 = str(input('введите первый этап развития человека: ')) # вводим Australopithecus (Австралопитек)
stage2 = str(input('введите второй этап развития человека: ')) # вводим Homo habilis (Человек умелый)
stage3 = str(input('введите третий этап развития человека: ')) # вводим Homo erectus (Человек прямоходящий)
stage4 = str(input('введите четвертый этап развития человека: '))# вводим Homo sapiens (Неандерталец)
stage5 = str(input('введите пятый этап развития человека: ')) # вводим Homo sapiens sapiens (Человек разумный)
print(stage1, stage2, stage3, stage4, stage5, sep='=>') # получаем вывод одной строкой черз знак '=>'